海盗口号 = "吓死我的木头"  # 定义一个变量 海盗口号，值为 "吓死我的木头"
吓死我的木头 = True  # 定义一个布尔变量 吓死我的木头，值为 True
密码 = input("请输入你的密码:")  # 提示用户输入密码，并将输入的值赋给变量 密码

print(海盗口号 + "因为我要远航")  # 打印 海盗口号 的值加上字符串 "因为我要远航"

if 吓死我的木头:  # 如果 吓死我的木头 为 True
    print("因为我要远航")  # 打印 "因为我要远航"
else:  # 否则
    print("别吓我 ):")  # 打印 "别吓我 ):"

if len(密码) < 10 :  # 如果密码的长度小于 10
    print("太垃圾了")  # 打印 "太垃圾了"
else:  # 否则
    print("挺好的+200社会信用")  # 打印 "挺好的"

真夜中 = 3  # 定义一个变量 真夜中，值为 3
while 真夜中 < 2:  # 当 真夜中 小于 2 时
    print("你好")  # 打印 "你好"
    真夜中 = 真夜中 + 1  # 将 真夜中 的值加 1